<?php 
//==============================
//ログ
//==============================
//ログをとるか
ini_set('log_errors', 'on');
//ログの出力ファイル
ini_set('error_log', 'php.log');


//==============================
//デバッグ
//==============================
//デバッグフラグ（trueならデバッグをとる）
$debug_flg = true;
function debug($str){
  global $debug_flg;
  if(!empty($debug_flg)){
    error_log('デバッグ：'.$str);
  }
}

//==============================
//画面表示処理開始ログ吐き出し関数
//==============================
// セッションを使う
function debugLogStart(){
  debug('[[[[[[[[[[[[[[[[[[[[画面表示処理開始');
  debug('');
  debug('');
}

//==============================
//定数設定
//==============================
// エラーメッセージを定数に格納
define('MSG01', '入力必須です');
define('MSG02', 'Emailの形式で入力してください');
define('MSG03', 'パスワード（歳入力）が合っていません');
define('MSG04', '半角英数字のみご利用いただけます');
define('MSG05', '6文字以上で入力してください');
define('MSG06', '256文字以上で入力してください');
define('MSG07', 'エラーが発生しました。しばらく経ってからやり直してください');
define('MSG08', 'そのEmailはすでに登録されています');
define('MSG09', 'メールアドレス、もしくはパスワードが不正です');
define('MSG10', '');

//==============================
//グローバル変数
//==============================
//エラーメッセージ格納用の配列
$err_msg = array();

//==============================
//バリデーション関数
//==============================
// 未入力チェック
//$str = フォームに入力する文字列
// $key = input要素の name属性（今回はemail, username, pass, pass_re）
function varidRequired($str, $key){
  if(empty($str)){
    global $err_msg;
    $err_msg[$key] = MSG01;
  }
}

// Email形式チェック
// Email重複チェック
// username形式チェック
// 同値チェック
// 最大文字数チェック
// 最小文字数チェック
// 半角英数字チェック


?>